
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <title>初始装载 · Data Mining</title>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.0.0">
        <meta name="author" content="zealscott">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-katex-plus/katex.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="time load.html" />
    
    
    <link rel="prev" href="data cleaning.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://tech.zealscott.com" target="_blank" class="custom-link">Homepage</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="sql server.html">
            
                <a href="sql server.html">
            
                    
                    SQL Server 和 SSBI 使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="udw.html">
            
                <a href="udw.html">
            
                    
                    UDW云数据仓库
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="history.html">
            
                <a href="history.html">
            
                    
                    历史拉链表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="log.html">
            
                <a href="log.html">
            
                    
                    日志分析
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="column store.html">
            
                <a href="column store.html">
            
                    
                    OLAP 列存储
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="tpch.html">
            
                <a href="tpch.html">
            
                    
                    基准评测
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="mvcc.html">
            
                <a href="mvcc.html">
            
                    
                    数据仓库之表膨胀
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="json.html">
            
                <a href="json.html">
            
                    
                    数据仓库之 Json 格式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="hive.html">
            
                <a href="hive.html">
            
                    
                    Hive 使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="model.html">
            
                <a href="model.html">
            
                    
                    建立数据仓库模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="sqoop.html">
            
                <a href="sqoop.html">
            
                    
                    Sqoop 抽取数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="data cleaning.html">
            
                <a href="data cleaning.html">
            
                    
                    数据清洗
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.14" data-path="first load.html">
            
                <a href="first load.html">
            
                    
                    初始装载
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="time load.html">
            
                <a href="time load.html">
            
                    
                    定期装载
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="optimization.html">
            
                <a href="optimization.html">
            
                    
                    Hive 优化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="recap.html">
            
                <a href="recap.html">
            
                    
                    OLAP 期末总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >初始装载</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x521D;&#x59CB;&#x88C5;&#x8F7D;">&#x521D;&#x59CB;&#x88C5;&#x8F7D;</h2>
<p>&#x5728;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x524D;&#xFF0C;&#x9700;&#x8981;&#x88C5;&#x8F7D;&#x5386;&#x53F2;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x4E9B;&#x5386;&#x53F2;&#x6570;&#x636E;&#x662F;&#x5BFC;&#x5165;&#x8FDB;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x5408;&#x3002;</p>
<p>&#x9996;&#x6B21;&#x88C5;&#x8F7D;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x521D;&#x59CB;&#x88C5;&#x8F7D;</strong>&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x4E00;&#x6B21;&#x6027;&#x5DE5;&#x4F5C;&#x3002;&#x7531;&#x6700;&#x7EC8;&#x7528;&#x6237;&#x6765;&#x51B3;&#x5B9A;&#x6709;&#x591A;&#x5C11;&#x5386;&#x53F2;&#x6570;&#x636E;&#x8FDB;&#x5165;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x4F7F;&#x7528;&#x7684;&#x5F00;&#x59CB;&#x65F6;&#x95F4;&#x662F;2015&#x5E74;3&#x6708;1&#x65E5;&#xFF0C;&#x800C;&#x7528;&#x6237;&#x5E0C;&#x671B;&#x88C5;&#x8F7D;&#x4E24;&#x5E74;&#x7684;&#x5386;&#x53F2;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x8BE5;&#x521D;&#x59CB;&#x88C5;&#x8F7D;2013&#x5E74;3&#x6708;1&#x65E5;&#x5230;2015&#x5E74;2&#x6708;28&#x65E5;&#x4E4B;&#x95F4;&#x7684;&#x6E90;&#x6570;&#x636E;&#x3002;&#x5728;2015&#x5E74;3&#x6708;2&#x65E5;&#x88C5;&#x8F7D;2015&#x5E74;3&#x6708;1&#x65E5;&#x7684;&#x6570;&#x636E;&#xFF08;&#x5047;&#x8BBE;&#x6267;&#x884C;&#x9891;&#x7387;&#x662F;&#x6BCF;&#x5929;&#x4E00;&#x6B21;&#xFF09;&#xFF0C;&#x4E4B;&#x540E;&#x5468;&#x671F;&#x6027;&#x5730;&#x6BCF;&#x5929;&#x88C5;&#x8F7D;&#x524D;&#x4E00;&#x5929;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p><strong>&#x5728;&#x88C5;&#x8F7D;&#x4E8B;&#x5B9E;&#x8868;&#x524D;&#xFF0C;&#x5FC5;&#x987B;&#x5148;&#x88C5;&#x8F7D;&#x6240;&#x6709;&#x7684;&#x7EF4;&#x5EA6;&#x8868;&#x3002;</strong>&#x56E0;&#x4E3A;&#x4E8B;&#x5B9E;&#x8868;&#x9700;&#x8981;&#x5F15;&#x7528;&#x7EF4;&#x5EA6;&#x7684;&#x4EE3;&#x7406;&#x952E;&#x3002;&#x8FD9;&#x4E0D;&#x4EC5;&#x9488;&#x5BF9;&#x521D;&#x59CB;&#x88C5;&#x8F7D;&#xFF0C;&#x4E5F;&#x9488;&#x5BF9;&#x5B9A;&#x671F;&#x88C5;&#x8F7D;&#x3002;&#x672C;&#x6B21;&#x5B9E;&#x9A8C;&#x4E3B;&#x8981;&#x8BF4;&#x660E;&#x6267;&#x884C;&#x521D;&#x59CB;&#x88C5;&#x8F7D;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x5305;&#x62EC;&#x6807;&#x8BC6;&#x6E90;&#x6570;&#x636E;&#x3001;&#x7EF4;&#x5EA6;&#x5386;&#x53F2;&#x7684;&#x5904;&#x7406;&#x3001;&#x4F7F;&#x7528;HiveQL&#x5F00;&#x53D1;&#x548C;&#x9A8C;&#x8BC1;&#x521D;&#x59CB;&#x88C5;&#x8F7D;&#x8FC7;&#x7A0B;&#x3002;</p>
<h3 id="&#x6807;&#x8BC6;&#x6E90;&#x6570;&#x636E;">&#x6807;&#x8BC6;&#x6E90;&#x6570;&#x636E;</h3>
<p>&#x8BBE;&#x8BA1;&#x5F00;&#x53D1;&#x521D;&#x59CB;&#x88C5;&#x8F7D;&#x6B65;&#x9AA4;&#x524D;&#x9700;&#x8981;&#x8BC6;&#x522B;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x7684;&#x6BCF;&#x4E2A;&#x4E8B;&#x5B9E;&#x8868;&#x548C;&#x6BCF;&#x4E2A;&#x7EF4;&#x5EA6;&#x8868;&#x7528;&#x5230;&#x7684;&#x5E76;&#x4E14;&#x662F;&#x53EF;&#x7528;&#x7684;&#x6E90;&#x6570;&#x636E;&#xFF0C;&#x8FD8;&#x8981;&#x4E86;&#x89E3;&#x6570;&#x636E;&#x6E90;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x4F8B;&#x5982;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x3001;&#x8BB0;&#x5F55;&#x7ED3;&#x6784;&#x548C;&#x53EF;&#x8BBF;&#x95EE;&#x6027;&#x7B49;&#x3002;</p>
<p>&#x4E0B;&#x8868;&#x663E;&#x793A;&#x7684;&#x662F;&#x9500;&#x552E;&#x8BA2;&#x5355;&#x793A;&#x4F8B;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x9700;&#x8981;&#x7684;&#x6E90;&#x6570;&#x636E;&#x7684;&#x5173;&#x952E;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;&#x6E90;&#x6570;&#x636E;&#x8868;&#x3001;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x76EE;&#x6807;&#x8868;&#x7B49;&#x5C5E;&#x6027;&#x3002;&#x8FD9;&#x7C7B;&#x8868;&#x683C;&#x901A;&#x5E38;&#x79F0;&#x4F5C;&#x6570;&#x636E;&#x6E90;&#x5BF9;&#x5E94;&#x56FE;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53CD;&#x6620;&#x4E86;&#x6BCF;&#x4E2A;&#x4ECE;&#x6E90;&#x6570;&#x636E;&#x5230;&#x76EE;&#x6807;&#x6570;&#x636E;&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#x3002;&#x751F;&#x6210;&#x8FD9;&#x4E2A;&#x8868;&#x683C;&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x903B;&#x8F91;&#x6570;&#x636E;&#x6620;&#x5C04;&#x3002;&#x5728;&#x672C;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x5BA2;&#x6237;&#x548C;&#x4EA7;&#x54C1;&#x7684;&#x6E90;&#x6570;&#x636E;&#x76F4;&#x63A5;&#x4E0E;&#x5176;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x91CC;&#x7684;&#x76EE;&#x6807;&#x8868;<code>customer_dim</code>&#x548C;<code>product_dim</code>&#x8868;&#x76F8;&#x5BF9;&#x5E94;&#xFF0C;&#x800C;&#x9500;&#x552E;&#x8BA2;&#x5355;&#x4E8B;&#x52A1;&#x8868;&#x662F;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x8868;&#x7684;&#x6570;&#x636E;&#x6E90;&#x3002;</p>
<p><img src="images/dim1.png" alt="dim1"></p>
<h3 id="&#x7EAC;&#x5EA6;&#x5386;&#x53F2;&#x7684;&#x6570;&#x636E;">&#x7EAC;&#x5EA6;&#x5386;&#x53F2;&#x7684;&#x6570;&#x636E;</h3>
<p>&#x5927;&#x591A;&#x6570;&#x7EF4;&#x5EA6;&#x503C;&#x662F;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x6539;&#x53D8;&#x7684;&#xFF0C;&#x5982;&#x5BA2;&#x6237;&#x6539;&#x53D8;&#x4E86;&#x59D3;&#x540D;&#xFF0C;&#x4EA7;&#x54C1;&#x7684;&#x540D;&#x79F0;&#x6216;&#x5206;&#x7C7B;&#x53D8;&#x5316;&#x7B49;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#x6539;&#x53D8;&#xFF0C;&#x6BD4;&#x5982;&#x5F53;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x6709;&#x4E86;&#x65B0;&#x7684;&#x5206;&#x7C7B;&#x65F6;&#xFF0C;&#x6709;&#x5FC5;&#x8981;&#x8BB0;&#x5F55;&#x7EF4;&#x5EA6;&#x7684;&#x5386;&#x53F2;&#x53D8;&#x5316;&#x4FE1;&#x606F;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;product_dim&#x8868;&#x91CC;&#x5FC5;&#x987B;&#x65E2;&#x5B58;&#x50A8;&#x4EA7;&#x54C1;&#x8001;&#x7684;&#x5206;&#x7C7B;&#xFF0C;&#x4E5F;&#x5B58;&#x50A8;&#x4EA7;&#x54C1;&#x5F53;&#x524D;&#x7684;&#x5206;&#x7C7B;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x8001;&#x7684;&#x9500;&#x552E;&#x8BA2;&#x5355;&#x91CC;&#x7684;&#x4EA7;&#x54C1;&#x5F15;&#x7528;&#x8001;&#x7684;&#x5206;&#x7C7B;&#x3002;</p>
<p>&#x6E10;&#x53D8;&#x7EF4;&#xFF08;SCD&#xFF09;&#x5373;&#x662F;&#x4E00;&#x79CD;&#x5728;&#x591A;&#x7EF4;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x4E2D;&#x5B9E;&#x73B0;&#x7EF4;&#x5EA6;&#x5386;&#x53F2;&#x7684;&#x6280;&#x672F;&#x3002;&#x6709;&#x4E09;&#x79CD;&#x4E0D;&#x540C;&#x7684;SCD&#x6280;&#x672F;&#xFF1A;SCD&#x7C7B;&#x578B;1&#xFF08;SCD1&#xFF09;&#xFF0C;SCD&#x7C7B;&#x578B;2&#xFF08;SCD2&#xFF09;&#xFF0C;SCD&#x7C7B;&#x578B;3&#xFF08;SCD3&#xFF09;&#x3002;        </p>
<ul>
<li>SCD1&#xFF1A;<strong>&#x901A;&#x8FC7;&#x66F4;&#x65B0;&#x7EF4;&#x5EA6;&#x8BB0;&#x5F55;&#x76F4;&#x63A5;&#x8986;&#x76D6;&#x5DF2;&#x5B58;&#x5728;&#x7684;&#x503C;</strong>&#xFF0C;&#x5B83;&#x4E0D;&#x7EF4;&#x62A4;&#x8BB0;&#x5F55;&#x7684;&#x5386;&#x53F2;&#x3002;SCD1&#x4E00;&#x822C;&#x7528;&#x4E8E;&#x4FEE;&#x6539;&#x9519;&#x8BEF;&#x7684;&#x6570;&#x636E;&#x3002;</li>
<li>SCD2&#xFF1A;&#x5728;&#x6E90;&#x6570;&#x636E;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x65F6;&#xFF0C;<strong>&#x7ED9;&#x7EF4;&#x5EA6;&#x8BB0;&#x5F55;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x201C;&#x7248;&#x672C;&#x201D;&#x8BB0;&#x5F55;</strong>&#xFF0C;&#x4ECE;&#x800C;&#x7EF4;&#x62A4;&#x7EF4;&#x5EA6;&#x5386;&#x53F2;&#x3002;SCD2&#x4E0D;&#x5220;&#x9664;&#x3001;&#x4FEE;&#x6539;&#x5DF2;&#x5B58;&#x5728;&#x7684;&#x6570;&#x636E;&#x3002;</li>
<li>SCD3&#xFF1A;<strong>&#x901A;&#x5E38;&#x7528;&#x4F5C;&#x4FDD;&#x6301;&#x7EF4;&#x5EA6;&#x8BB0;&#x5F55;&#x7684;&#x51E0;&#x4E2A;&#x7248;&#x672C;</strong>&#x3002;&#x5B83;&#x901A;&#x8FC7;&#x7ED9;&#x67D0;&#x4E2A;&#x6570;&#x636E;&#x5355;&#x5143;&#x589E;&#x52A0;&#x591A;&#x4E2A;&#x5217;&#x6765;&#x7EF4;&#x62A4;&#x5386;&#x53F2;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E3A;&#x4E86;&#x8BB0;&#x5F55;&#x5BA2;&#x6237;&#x5730;&#x5740;&#x7684;&#x53D8;&#x5316;&#xFF0C;customer_dim&#x7EF4;&#x5EA6;&#x8868;&#x6709;&#x4E00;&#x4E2A;customer_address&#x5217;&#x548C;&#x4E00;&#x4E2A;previous_customer_address&#x5217;&#xFF0C;&#x5206;&#x522B;&#x8BB0;&#x5F55;&#x5F53;&#x524D;&#x548C;&#x4E0A;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x5730;&#x5740;&#x3002;SCD3&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x7EF4;&#x62A4;&#x6709;&#x9650;&#x7684;&#x5386;&#x53F2;&#xFF0C;&#x800C;&#x4E0D;&#x50CF;SCD2&#x90A3;&#x6837;&#x4FDD;&#x5B58;&#x5168;&#x90E8;&#x5386;&#x53F2;&#x3002;SCD3&#x5F88;&#x5C11;&#x4F7F;&#x7528;&#x3002;&#x5B83;&#x53EA;&#x9002;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4E0D;&#x8DB3;&#x5E76;&#x4E14;&#x7528;&#x6237;&#x63A5;&#x53D7;&#x6709;&#x9650;&#x7EF4;&#x5EA6;&#x5386;&#x53F2;&#x7684;&#x60C5;&#x51B5;&#x3002;  </li>
</ul>
<h3 id="&#x7EAC;&#x5EA6;&#x5386;&#x53F2;&#x7684;&#x5904;&#x7406;">&#x7EAC;&#x5EA6;&#x5386;&#x53F2;&#x7684;&#x5904;&#x7406;</h3>
<p>&#x540C;&#x4E00;&#x7EF4;&#x5EA6;&#x8868;&#x4E2D;&#x7684;&#x4E0D;&#x540C;&#x5B57;&#x6BB5;&#x53EF;&#x4EE5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x53D8;&#x5316;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x3002;&#x5728;&#x672C;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x5BA2;&#x6237;&#x7EF4;&#x5EA6;&#x5386;&#x53F2;&#x7684;&#x5BA2;&#x6237;&#x540D;&#x79F0;&#x4F7F;&#x7528;SCD1&#xFF0C;&#x5BA2;&#x6237;&#x5730;&#x5740;&#x4F7F;&#x7528;SCD2&#xFF0C;&#x4EA7;&#x54C1;&#x7EF4;&#x5EA6;&#x7684;&#x4E24;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x4EA7;&#x54C1;&#x540D;&#x79F0;&#x548C;&#x4EA7;&#x54C1;&#x7C7B;&#x578B;&#x90FD;&#x4F7F;&#x7528;SCD2&#x4FDD;&#x5B58;&#x5386;&#x53F2;&#x53D8;&#x5316;&#x6570;&#x636E;&#x3002;</p>
<p>&#x591A;&#x7EF4;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x4E2D;&#x7684;&#x7EF4;&#x5EA6;&#x8868;&#x548C;&#x4E8B;&#x5B9E;&#x8868;&#x4E00;&#x822C;&#x90FD;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x4EE3;&#x7406;&#x952E;&#xFF0C;&#x4F5C;&#x4E3A;&#x8FD9;&#x4E9B;&#x8868;&#x7684;&#x4E3B;&#x952E;&#xFF0C;&#x4EE3;&#x7406;&#x952E;&#x4E00;&#x822C;&#x7531;&#x5355;&#x5217;&#x7684;&#x81EA;&#x589E;&#x6570;&#x5B57;&#x5E8F;&#x5217;&#x6784;&#x6210;&#x3002;Hive&#x6CA1;&#x6709;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x81EA;&#x589E;&#x5217;&#xFF0C;&#x4F46;&#x5B83;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x5BF9;&#x81EA;&#x589E;&#x5E8F;&#x5217;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x901A;&#x5E38;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x751F;&#x6210;&#x4EE3;&#x7406;&#x952E;&#xFF1A;&#x4F7F;&#x7528;<code>row_number()</code>&#x7A97;&#x53E3;&#x51FD;&#x6570;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;<code>UDFRowSequence</code>&#x7684;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#xFF08;UDF&#xFF09;&#x3002;</p>
<ul>
<li>&#x5047;&#x8BBE;&#x6709;&#x7EF4;&#x5EA6;&#x8868;<code>tbl_dim</code>&#x548C;&#x8FC7;&#x6E21;&#x8868;<code>tbl_stg</code>&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x5C06;<code>tbl_stg</code>&#x7684;&#x6570;&#x636E;&#x88C5;&#x8F7D;&#x5230;<code>tbl_dim</code>&#xFF0C;&#x88C5;&#x8F7D;&#x7684;&#x540C;&#x65F6;&#x751F;&#x6210;&#x7EF4;&#x5EA6;&#x8868;&#x7684;&#x4EE3;&#x7406;&#x952E;&#x3002;</li>
<li>&#x7528;<code>row_number()</code>&#x51FD;&#x6570;&#x751F;&#x6210;&#x4EE3;&#x7406;&#x952E;</li>
</ul>
<p>&#x5148;&#x5EFA;&#x7ACB;&#x6D4B;&#x8BD5;&#x6240;&#x9700;&#x7684;&#x7EF4;&#x5EA6;&#x8868;&#x548C;&#x4E8B;&#x5B9E;&#x8868;&#xFF0C;&#x5E76;&#x63D2;&#x5165;&#x6570;&#x636E;&#xFF1A;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">use</span> <span class="hljs-keyword">test</span>;
<span class="hljs-keyword">drop</span> <span class="hljs-keyword">table</span> <span class="hljs-keyword">if</span> <span class="hljs-keyword">exists</span> tbl_dim;
<span class="hljs-keyword">drop</span> <span class="hljs-keyword">table</span> <span class="hljs-keyword">if</span> <span class="hljs-keyword">exists</span> tbl_stg;
<span class="hljs-keyword">create</span> <span class="hljs-keyword">table</span> tbl_stg(<span class="hljs-keyword">id</span> <span class="hljs-built_in">int</span>, sk <span class="hljs-built_in">int</span>, address <span class="hljs-built_in">varchar</span>(<span class="hljs-number">10</span>));
<span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> tbl_stg <span class="hljs-keyword">values</span>(<span class="hljs-number">2</span>,<span class="hljs-number">2</span>,<span class="hljs-string">&apos;qwe&apos;</span>);
<span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> tbl_stg <span class="hljs-keyword">values</span>(<span class="hljs-number">3</span>,<span class="hljs-number">3</span>,<span class="hljs-string">&apos;asd&apos;</span>);
<span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> tbl_stg <span class="hljs-keyword">values</span>(<span class="hljs-number">4</span>,<span class="hljs-number">4</span>,<span class="hljs-string">&apos;zxc&apos;</span>);
<span class="hljs-keyword">create</span> <span class="hljs-keyword">table</span> tbl_dim(<span class="hljs-keyword">key</span> <span class="hljs-built_in">int</span>, <span class="hljs-keyword">id</span> <span class="hljs-built_in">int</span>,sk <span class="hljs-built_in">int</span>, address <span class="hljs-built_in">varchar</span>(<span class="hljs-number">10</span>));
</code></pre>
<p>&#x7528;<code>row_number()</code>&#x51FD;&#x6570;&#x751F;&#x6210;&#x4EE3;&#x7406;&#x5EFA;</p>
<pre><code>set hive.mapred.mode;
set hive.mapred.mode=nonstrict;
set hive.mapred.mode;

set hive.strict.checks.cartesian.product;
set hive.strict.checks.cartesian.product=false;
set hive.strict.checks.cartesian.product;
</code></pre><p>&#x5148;&#x67E5;&#x8BE2;&#x7EF4;&#x5EA6;&#x8868;&#x4E2D;&#x5DF2;&#x6709;&#x8BB0;&#x5F55;&#x6700;&#x5927;&#x7684;&#x4EE3;&#x7406;&#x952E;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x7EF4;&#x5EA6;&#x8868;&#x4E2D;&#x8FD8;&#x6CA1;&#x6709;&#x8BB0;&#x5F55;&#xFF0C;&#x5229;&#x7528;coalesce&#x51FD;&#x6570;&#x8FD4;&#x56DE;0&#x3002;&#x7136;&#x540E;&#x4F7F;&#x7528;cross join&#x8FDE;&#x63A5;&#x751F;&#x6210;&#x8FC7;&#x6E21;&#x8868;&#x548C;&#x6700;&#x5927;&#x4EE3;&#x7406;&#x952E;&#x503C;&#x7684;&#x7B1B;&#x5361;&#x5C14;&#x96C6;&#xFF0C;&#x6700;&#x540E;&#x4F7F;&#x7528;row_number()&#x51FD;&#x6570;&#x751F;&#x6210;&#x884C;&#x53F7;&#xFF0C;&#x5E76;&#x5C06;&#x884C;&#x53F7;&#x4E0E;&#x6700;&#x5927;&#x4EE3;&#x7406;&#x952E;&#x503C;&#x76F8;&#x52A0;&#x7684;&#x503C;&#xFF0C;&#x4F5C;&#x4E3A;&#x65B0;&#x88C5;&#x8F7D;&#x8BB0;&#x5F55;&#x7684;&#x4EE3;&#x7406;&#x952E;&#x3002;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> tbl_dim <span class="hljs-keyword">select</span> row_number() <span class="hljs-keyword">over</span> (<span class="hljs-keyword">order</span> <span class="hljs-keyword">by</span> tbl_stg.<span class="hljs-keyword">id</span>) + t2.sk_max, tbl_stg.* <span class="hljs-keyword">from</span> tbl_stg <span class="hljs-keyword">cross</span> <span class="hljs-keyword">join</span> (<span class="hljs-keyword">select</span> <span class="hljs-keyword">coalesce</span>(<span class="hljs-keyword">max</span>(sk),<span class="hljs-number">0</span>) sk_max <span class="hljs-keyword">from</span> tbl_dim) t2;
</code></pre>
<p>&#x6B64;&#x65F6;&#xFF0C;&#x7EF4;&#x5EA6;&#x8868;&#x4E2D;&#x5DF2;&#x7ECF;&#x88C5;&#x8F7D;&#x4E86;&#x6570;&#x636E;&#xFF1A;</p>
<p><img src="images/dim2.png" alt="dim2"></p>
<ul>
<li><p>&#x7528;UDFRowSequence&#x751F;&#x6210;&#x4EE3;&#x7406;&#x952E;</p>
<ul>
<li><p><code>hive-contrib-2.0.0.jar</code>&#x4E2D;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x751F;&#x6210;&#x8BB0;&#x5F55;&#x5E8F;&#x53F7;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x51FD;&#x6570;<code>udfrowsequence</code>&#x3002;&#x4E0A;&#x9762;&#x7684;&#x8BED;&#x53E5;&#x5148;&#x52A0;&#x8F7D;JAR&#x5305;&#xFF0C;&#x7136;&#x540E;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;<code>row_sequence()</code>&#x7684;&#x4E34;&#x65F6;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x8C03;&#x7528;UDF&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x4E3A;&#x67E5;&#x8BE2;&#x7684;&#x7ED3;&#x679C;&#x96C6;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x81EA;&#x589E;&#x4F2A;&#x5217;&#x3002;&#x4E4B;&#x540E;&#x5C31;&#x548C;<code>row_number()</code>&#x5199;&#x6CD5;&#x7C7B;&#x4F3C;&#x4E86;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x5C06;&#x7A97;&#x53E3;&#x51FD;&#x6570;<code>row_number()</code>&#x66FF;&#x6362;&#x4E3A;<code>row_sequence()</code>&#x51FD;&#x6570;&#x3002;</p>
</li>
<li><pre><code class="lang-sql"><span class="hljs-keyword">truncate</span> <span class="hljs-keyword">table</span> tbl_dim;
add jar /usr/local/hive/lib/hive-contrib-2.3.0.jar;
<span class="hljs-keyword">create</span> <span class="hljs-keyword">temporary</span> <span class="hljs-keyword">function</span> row_sequence <span class="hljs-keyword">as</span> <span class="hljs-string">&apos;org.apache.hadoop.hive.contrib.udf.UDFRowSequence&apos;</span>;

<span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> tbl_dim <span class="hljs-keyword">select</span> row_sequence() + t2.sk_max, tbl_stg.* <span class="hljs-keyword">from</span> tbl_stg <span class="hljs-keyword">cross</span> <span class="hljs-keyword">join</span>(<span class="hljs-keyword">select</span> <span class="hljs-keyword">coalesce</span>(<span class="hljs-keyword">max</span>(sk),<span class="hljs-number">0</span>) sk_max <span class="hljs-keyword">from</span> tbl_dim)t2;
</code></pre>
</li>
<li><p>&#x7ED3;&#x679C;&#x4E0E;&#x4E4B;&#x524D;&#x76F8;&#x540C;</p>
</li>
</ul>
</li>
</ul>
<h2 id="&#x521D;&#x59CB;&#x6570;&#x636E;&#x62BD;&#x53D6;">&#x521D;&#x59CB;&#x6570;&#x636E;&#x62BD;&#x53D6;</h2>
<p>&#x5EFA;&#x7ACB;<code>sqoop</code>&#x5BFC;&#x5165;&#x4F5C;&#x4E1A;&#xFF0C;&#x62BD;&#x53D6;<code>sales_order</code>&#x6570;&#x636E;&#x5230;RDS&#x5E93;</p>
<pre><code>use rds;
truncate table customer;
truncate table product;
truncate table sales_order;

##&#x521B;&#x5EFA;&#x4F5C;&#x4E1A;
sqoop job --delete myjob_incremental_import 

sqoop job --create myjob_incremental_import \
-- import \
--connect &quot;jdbc:mysql://localhost:3306/source?useSSL=false&amp;user=root&amp;password=scott5183&quot; \
--table sales_order \
--columns &quot;order_number, customer_number, product_code, order_date, entry_date, order_amount&quot; \
--hive-import \
--hive-table rds.sales_order \
--incremental append \
--check-column order_amount \
--last-value 0

sqoop job --exec myjob_incremental_import
</code></pre><p>&#x5168;&#x91CF;&#x62BD;&#x53D6;&#x5BA2;&#x6237;&#x548C;&#x4EA7;&#x54C1;&#x6570;&#x636E;&#x5230;RDS&#x5E93;</p>
<pre><code class="lang-sql">sqoop import <span class="hljs-comment">--connect jdbc:mysql://localhost:3306/source?useSSL=false --username=root --password scott5183 --table customer --hive-import --hive-table rds.customer --hive-overwrite</span>

sqoop import <span class="hljs-comment">--connect jdbc:mysql://localhost:3306/source?useSSL=false --username=root --password scott5183 --table product --hive-import --hive-table rds.product --hive-overwrite</span>
</code></pre>
<p>&#x88C5;&#x8F7D;&#x5BA2;&#x6237;&#x7EF4;&#x5EA6;&#x8868;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">use</span> dw;
<span class="hljs-keyword">truncate</span> <span class="hljs-keyword">table</span> customer_dim;
<span class="hljs-keyword">truncate</span> <span class="hljs-keyword">table</span> product_dim;
<span class="hljs-keyword">truncate</span> <span class="hljs-keyword">table</span> order_dim;
<span class="hljs-keyword">truncate</span> <span class="hljs-keyword">table</span> sales_order_fact;

<span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> customer_dim 
<span class="hljs-keyword">select</span> row_number() <span class="hljs-keyword">over</span> (<span class="hljs-keyword">order</span> <span class="hljs-keyword">by</span> t1.customer_number) + t2.sk_max, t1.customer_number, t1.customer_name, t1.customer_street_address,t1.customer_zip_code, t1.customer_city, t1.customer_state,<span class="hljs-number">1</span>,<span class="hljs-string">&apos;2016-03-01&apos;</span>,<span class="hljs-string">&apos;2200-01-01&apos;</span> 
<span class="hljs-keyword">from</span> rds.customer t1 <span class="hljs-keyword">cross</span> <span class="hljs-keyword">join</span>(<span class="hljs-keyword">select</span> <span class="hljs-keyword">coalesce</span>(<span class="hljs-keyword">max</span> (customer_sk),<span class="hljs-number">0</span>) sk_max <span class="hljs-keyword">from</span> customer_dim) t2;
</code></pre>
<p><img src="images/dim3.png" alt="dim3"></p>
<p>&#x88C5;&#x8F7D;&#x4EA7;&#x54C1;&#x7EF4;&#x5EA6;&#x8868;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> product_dim 
<span class="hljs-keyword">select</span> row_number() <span class="hljs-keyword">over</span> (<span class="hljs-keyword">order</span> <span class="hljs-keyword">by</span> t1.product_code) + t2.sk_max, product_code, product_name, product_category,<span class="hljs-number">1</span>, <span class="hljs-string">&apos;2016-03-01&apos;</span>,<span class="hljs-string">&apos;2200-01-01&apos;</span> 
<span class="hljs-keyword">from</span> rds.product t1 <span class="hljs-keyword">cross</span> <span class="hljs-keyword">join</span>(<span class="hljs-keyword">select</span> <span class="hljs-keyword">coalesce</span>(<span class="hljs-keyword">max</span> (product_sk),<span class="hljs-number">0</span>) sk_max <span class="hljs-keyword">from</span> product_dim) t2;
</code></pre>
<p><img src="images/dim2.png" alt="dim2"></p>
<p>&#x88C5;&#x8F7D;&#x8BA2;&#x5355;&#x7EF4;&#x5EA6;&#x8868;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> order_dim 
<span class="hljs-keyword">select</span> row_number() <span class="hljs-keyword">over</span> (<span class="hljs-keyword">order</span> <span class="hljs-keyword">by</span> t1.order_number) + t2.sk_max, order_number,<span class="hljs-number">1</span>, order_date,<span class="hljs-string">&apos;2200-01-01&apos;</span> 
<span class="hljs-keyword">from</span> rds.sales_order t1 <span class="hljs-keyword">cross</span> <span class="hljs-keyword">join</span>(<span class="hljs-keyword">select</span> <span class="hljs-keyword">coalesce</span>(<span class="hljs-keyword">max</span> (order_sk),<span class="hljs-number">0</span>) sk_max <span class="hljs-keyword">from</span> order_dim) t2;
</code></pre>
<p><img src="images/dim3.png" alt="dim3"></p>
<p>&#x88C5;&#x8F7D;&#x9500;&#x552E;&#x8BA2;&#x5355;&#x4E8B;&#x5B9E;&#x8868;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> sales_order_fact 
<span class="hljs-keyword">select</span> order_sk,customer_sk,product_sk,date_sk,order_amount
<span class="hljs-keyword">from</span> rds.sales_order a,order_dim b, customer_dim c, product_dim d, date_dim e
<span class="hljs-keyword">where</span> a.order_number = b.order_number <span class="hljs-keyword">and</span> a.customer_number = c.customer_number <span class="hljs-keyword">and</span> a.product_code = d.product_code <span class="hljs-keyword">and</span> <span class="hljs-keyword">to_date</span>(a.order_date) = e.<span class="hljs-string">`date`</span>;
</code></pre>
<p><img src="images/dim4.png" alt="dim4"></p>
<p>&#x9A8C;&#x8BC1;&#x521D;&#x59CB;&#x88C5;&#x8F7D;&#x7684;&#x6B63;&#x786E;&#x6027;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">use</span> dw;
<span class="hljs-keyword">select</span> * <span class="hljs-keyword">from</span> customer_dim;
<span class="hljs-keyword">select</span> * <span class="hljs-keyword">from</span> product_dim;
<span class="hljs-keyword">select</span> * <span class="hljs-keyword">from</span> order_dim;
<span class="hljs-keyword">select</span> * <span class="hljs-keyword">from</span> sales_order_fact;
<span class="hljs-keyword">select</span> * <span class="hljs-keyword">from</span> date_dim;
<span class="hljs-keyword">select</span> order_number, customer_name, product_name,<span class="hljs-string">`date`</span>, order_amount amount <span class="hljs-keyword">from</span> sales_order_fact a, customer_dim b,product_dim c ,order_dim d, date_dim e <span class="hljs-keyword">where</span> a.customer_sk=b.customer_sk <span class="hljs-keyword">and</span> a.product_sk = c.product_sk <span class="hljs-keyword">and</span> a.order_sk = d.order_sk <span class="hljs-keyword">and</span> a.order_date_sk = e.date_sk <span class="hljs-keyword">order</span> <span class="hljs-keyword">by</span> order_number;
</code></pre>
<p><img src="images/dim5.png" alt="dim5"></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="data cleaning.html" class="navigation navigation-prev " aria-label="Previous page: 数据清洗">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="time load.html" class="navigation navigation-next " aria-label="Next page: 定期装载">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"初始装载","level":"1.14","depth":1,"next":{"title":"定期装载","level":"1.15","depth":1,"path":"time load.md","ref":"time load.md","articles":[]},"previous":{"title":"数据清洗","level":"1.13","depth":1,"path":"data cleaning.md","ref":"data cleaning.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","disqus","katex-plus","ga","back-to-top-button","-lunr","-search","search-pro","expandable-chapters"],"ignores":["node_modules","_book"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"disqus":{"shortName":"techzealscott","useIdentifier":false},"github":{"url":"https://github.com/scottdyt"},"search-pro":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"katex-plus":{},"back-to-top-button":{},"ga":{"token":"UA-116370175-1","configuration":"auto"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{}},"theme":"default","author":"zealscott","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"sortedBy":".","variables":{},"title":"Data Mining","links":{"sidebar":{"Homepage":"https://tech.zealscott.com"}},"gitbook":"*"},"file":{"path":"first load.md","mtime":"2021-01-29T08:10:39.221Z","type":"markdown"},"gitbook":{"version":"3.0.0","time":"2021-03-04T10:42:48.559Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/buttons.js"></script>
        
    

    </body>
</html>

